const add_on = {
  mfa_inline_notification:
    'MFA เป็นบริการเสริมราคา ${{price, number}} ต่อเดือนสำหรับ {{planName}} เดือนแรกจะคิดราคาตามรอบบิลของคุณ <a>ดูรายละเอียดเพิ่มเติม</a>',
  security_features_inline_notification:
    'เปิดใช้งาน CAPTCHA, ประสบการณ์ล็อกเอาต์แบบกำหนดเอง และฟีเจอร์ความปลอดภัยขั้นสูงอื่น ๆ — ทั้งหมดนี้รวมอยู่ในแพ็กเกจเสริมในราคาเพียง ${{price, number}} ต่อเดือน',
  footer: {
    api_resource:
      'ทรัพยากรเพิ่มเติมมีค่าบริการ <span>${{price, number}} ต่อเดือน / แต่ละรายการ</span> เดือนแรกจะคิดราคาตามรอบบิลของคุณ <a>ดูรายละเอียดเพิ่มเติม</a>',
    machine_to_machine_app:
      'แอปแมชชีนทูแมชชีนเพิ่มเติมมีค่าบริการ <span>${{price, number}} ต่อเดือน / ต่อแอป</span> เดือนแรกจะคิดราคาตามรอบบิลของคุณ <a>ดูรายละเอียดเพิ่มเติม</a>',
    enterprise_sso:
      'Enterprise SSO เป็นบริการเสริม <span>${{price, number}} ต่อเดือน / ต่อใบอนุญาต</span> สำหรับ {{planName}} เดือนแรกจะคิดราคาตามรอบบิลของคุณ <a>ดูรายละเอียดเพิ่มเติม</a>',
    tenant_members:
      'สมาชิกเพิ่มเติมมีค่าบริการ <span>${{price, number}} ต่อเดือน / ต่อคน</span> เดือนแรกจะคิดราคาตามรอบบิลของคุณ <a>ดูรายละเอียดเพิ่มเติม</a>',
    organization:
      'Organization เป็นบริการเสริม <span>${{price, number}} ต่อเดือน</span> สำหรับ {{planName}} พร้อมรองรับหลายองค์กรได้ไม่จำกัด เดือนแรกจะคิดราคาตามรอบบิลของคุณ <a>ดูรายละเอียดเพิ่มเติม</a>',
    saml_apps:
      'SAML แอปเพิ่มเติมมีค่าบริการ <span>${{price, number}} ต่อเดือน / ต่อแอป</span> เดือนแรกจะคิดราคาตามรอบบิลของคุณ <a>ดูรายละเอียดเพิ่มเติม</a>',
    third_party_apps:
      'แอปจากภายนอกเพิ่มเติมมีค่าบริการ <span>${{price, number}} ต่อเดือน / ต่อแอป</span> เดือนแรกจะคิดราคาตามรอบบิลของคุณ <a>ดูรายละเอียดเพิ่มเติม</a>',
    roles:
      'การควบคุมการเข้าถึงตามบทบาทเป็นบริการเสริม <span>${{price, number}} ต่อเดือน</span> สำหรับแผน Pro พร้อมรองรับบทบาทได้ไม่จำกัด เดือนแรกจะคิดราคาตามรอบบิลของคุณ <a>ดูรายละเอียดเพิ่มเติม</a>',
  },
};

export default Object.freeze(add_on);
