const add_on = {
  mfa_inline_notification:
    'MFA هو إضافة بتكلفة ${{price, number}} شهريًا لخطة {{planName}}. الشهر الأول محسوب استنادًا إلى دورة الفوترة الخاصة بك. <a>تعرف أكثر</a>',
  security_features_inline_notification:
    'تمكين CAPTCHA، وتخصيص تجربة الطرد، والميزات الأمنية المتقدمة الأخرى — جميعها متضمنة في حزمة إضافية مقابل فقط ${{price, number}}/الشهر.',
  footer: {
    api_resource:
      'تكلف الموارد الإضافية <span>${{price, number}} شهريًا / لكل واحدة</span>. الشهر الأول محسوب استنادًا إلى دورة الفوترة الخاصة بك. <a>تعرف أكثر</a>',
    machine_to_machine_app:
      'تكلف التطبيقات الإضافية للتواصل بين الآلات <span>${{price, number}} شهريًا / لكل واحدة</span>. الشهر الأول محسوب استنادًا إلى دورة الفوترة الخاصة بك. <a>تعرف أكثر</a>',
    enterprise_sso:
      'تكلفة تسجيل الدخول الموحد للمؤسسات <span>${{price, number}} شهريًا / لكل واحدة</span> إضافة لخطة {{planName}}. الشهر الأول محسوب استنادًا إلى دورة الفوترة الخاصة بك. <a>تعرف أكثر</a>',
    tenant_members:
      'تكلف الأعضاء الإضافيين <span>${{price, number}} شهريًا / لكل واحدة</span>. الشهر الأول محسوب استنادًا إلى دورة الفوترة الخاصة بك. <a>تعرف أكثر</a>',
    organization:
      'المنظمة هي إضافة بتكلفة <span>${{price, number}} شهريًا / لكل واحدة</span> لخطة {{planName}}. الشهر الأول محسوب استنادًا إلى دورة الفوترة الخاصة بك. <a>تعرف أكثر</a>',
    saml_apps:
      'التطبيقات الإضافية لـ SAML تكلف <span>${{price, number}} شهريًا / لكل واحدة</span>. الشهر الأول محسوب استنادًا إلى دورة الفوترة الخاصة بك. <a>تعرف أكثر</a>',
    third_party_apps:
      'التطبيقات التابعة لجهات خارجية الإضافية تكلف <span>${{price, number}} شهريًا / لكل واحدة</span>. الشهر الأول محسوب استنادًا إلى دورة الفوترة الخاصة بك. <a>تعرف أكثر</a>',
    roles:
      'التحكم في الوصول المستند إلى الدور هو إضافة بتكلفة <span>${{price, number}} شهريًا</span> لخطة Pro مع أدوار غير محدودة. الشهر الأول محسوب استنادًا إلى دورة الفوترة الخاصة بك. <a>تعرف أكثر</a>',
  },
};

export default Object.freeze(add_on);
