const contact = {
  title: 'Получить помощь',
  description:
    'Для запросов на помощь и отзывов о продукте, свяжитесь с нами через следующие методы.',
  discord: {
    title: 'Присоединяйтесь к Discord-сообществу',
    description:
      'Присоединяйтесь к нашему открытому каналу, чтобы общаться с другими разработчиками',
    button: 'Присоединиться',
  },
  github: {
    title: 'Создать проблему в GitHub',
    description: 'Создайте проблему и отправьте запрос в службу поддержки',
    button: 'Открыть',
  },
  email: {
    title: 'Связаться с поддержкой по электронной почте',
    description:
      'Отправьте нам электронное письмо для получения дополнительной информации и помощи',
    button: 'Отправить',
  },
};

export default contact;
