const account_center = {
  header: {
    title: 'Центр облікового запису',
  },
  home: {
    title: 'Сторінку не знайдено',
    description: 'Ця сторінка недоступна.',
  },
  verification: {
    title: 'Перевірка безпеки',
    description:
      'Підтвердьте, що це ви, щоб захистити безпеку облікового запису. Будь ласка, оберіть спосіб підтвердження особи.',
    error_send_failed: 'Не вдалося надіслати код підтвердження. Спробуйте ще раз пізніше.',
    error_invalid_code: 'Код підтвердження недійсний або строк його дії минув.',
    error_verify_failed: 'Не вдалося підтвердити. Будь ласка, введіть код ще раз.',
    verification_required: 'Термін перевірки минув. Підтвердіть свою особу ще раз.',
    try_another_method: 'Спробуйте інший спосіб підтвердження',
  },
  password_verification: {
    title: 'Підтвердьте пароль',
    description: 'Щоб захистити обліковий запис, введіть пароль для підтвердження своєї особи.',
    error_failed: 'Перевірка не вдалася. Перевірте пароль.',
  },
  verification_method: {
    password: {
      name: 'Пароль',
      description: 'Підтвердьте свій пароль',
    },
    email: {
      name: 'Код підтвердження електронної пошти',
      description: 'Надіслати код підтвердження на вашу пошту',
    },
    phone: {
      name: 'Код підтвердження телефону',
      description: 'Надіслати код підтвердження на ваш номер телефону',
    },
  },
  email: {
    title: 'Прив’язати email',
    description:
      'Прив’яжіть свій email, щоб входити або допомогти з відновленням облікового запису.',
    verification_title: 'Введіть код підтвердження email',
    verification_description: 'Код підтвердження надіслано на ваш email {{email_address}}.',
    success: 'Основний email успішно прив’язано.',
    verification_required: 'Термін перевірки минув. Підтвердіть свою особу ще раз.',
  },
  phone: {
    title: 'Прив’язати телефон',
    description:
      'Прив’яжіть номер телефону, щоб увійти або допомогти з відновленням облікового запису.',
    verification_title: 'Введіть код підтвердження телефону',
    verification_description: 'Код підтвердження надіслано на ваш телефон {{phone_number}}.',
    success: 'Основний телефон успішно прив’язано.',
    verification_required: 'Термін перевірки минув. Підтвердіть свою особу ще раз.',
  },
  username: {
    title: 'Встановити ім’я користувача',
    description: 'Ім’я користувача може містити лише літери, цифри та символи підкреслення.',
    success: 'Ім’я користувача успішно оновлено.',
  },
  password: {
    title: 'Встановити пароль',
    description: 'Створіть новий пароль, щоб захистити свій обліковий запис.',
    success: 'Пароль успішно оновлено.',
  },

  code_verification: {
    send: 'Надіслати код підтвердження',
    resend: 'Надіслати код ще раз',
    resend_countdown: 'Ще не отримали? Повторна відправка через {{seconds}} с.',
  },

  email_verification: {
    title: 'Підтвердьте свою електронну пошту',
    prepare_description:
      'Підтвердіть, що це ви, щоб захистити безпеку облікового запису. Надішліть код підтвердження на свою електронну пошту.',
    email_label: 'Адреса електронної пошти',
    send: 'Надіслати код підтвердження',
    description: 'Код підтвердження надіслано на адресу {{email}}. Введіть код, щоб продовжити.',
    resend: 'Надіслати код ще раз',
    resend_countdown: 'Ще не отримали? Повторна відправка через {{seconds}} с.',
    error_send_failed: 'Не вдалося надіслати код підтвердження. Спробуйте ще раз пізніше.',
    error_verify_failed: 'Не вдалося підтвердити. Будь ласка, введіть код ще раз.',
    error_invalid_code: 'Код підтвердження недійсний або строк його дії минув.',
  },
  phone_verification: {
    title: 'Підтвердьте свій телефон',
    prepare_description:
      'Підтвердьте, що це ви, щоб захистити безпеку облікового запису. Надішліть код підтвердження на свій телефон.',
    phone_label: 'Номер телефону',
    send: 'Надіслати код підтвердження',
    description:
      'Код підтвердження надіслано на ваш телефон {{phone}}. Введіть код, щоб продовжити.',
    resend: 'Надіслати код ще раз',
    resend_countdown: 'Ще не отримали? Повторна відправка через {{seconds}} с.',
    error_send_failed: 'Не вдалося надіслати код підтвердження. Спробуйте ще раз пізніше.',
    error_verify_failed: 'Не вдалося підтвердити. Будь ласка, введіть код ще раз.',
    error_invalid_code: 'Код підтвердження недійсний або строк його дії минув.',
  },
  update_success: {
    default: {
      title: 'Оновлення успішне',
      description: 'Ваші зміни успішно збережено.',
    },
    email: {
      title: 'Електронну адресу оновлено!',
      description: 'Електронну адресу вашого облікового запису успішно змінено.',
    },
    phone: {
      title: 'Номер телефону оновлено!',
      description: 'Номер телефону вашого облікового запису успішно змінено.',
    },
    username: {
      title: 'Ім’я користувача оновлено!',
      description: 'Ім’я користувача вашого облікового запису успішно змінено.',
    },

    password: {
      title: 'Пароль оновлено!',
      description: 'Пароль вашого облікового запису успішно змінено.',
    },
  },
};

export default Object.freeze(account_center);
