const mfa = {
  title: 'احراز هویت چندعاملی',
  description: 'احراز هویت چندعاملی را اضافه کنید تا امنیت تجربه ورود خود را ارتقا دهید.',
  factors: 'عوامل',
  multi_factors: 'چندعاملی',
  multi_factors_description:
    'کاربران باید یکی از عوامل فعال‌شده را برای تأیید دو مرحله‌ای تأیید کنند.',
  totp: 'برنامه احراز هویت',
  otp_description:
    'Google Authenticator و موارد مشابه را متصل کنید تا رمزهای یک‌بارمصرف را تأیید کنید.',
  webauthn: 'Passkey',
  webauthn_description:
    'از طریق روش پشتیبانی‌شده مرورگر تأیید کنید: بیومتریک، اسکن تلفن یا کلید امنیتی و غیره.',
  webauthn_domain_tip:
    'WebAuthn کلیدهای عمومی را به دامنه خاص متصل می‌کند. تغییر دامنه سرویس شما مانع احراز هویت کاربران از طریق passkeyهای موجود می‌شود.',
  backup_code: 'کدهای پشتیبان',
  backup_code_description:
    'پس از راه‌اندازی هر روش MFA توسط کاربران، ۱۰ کد پشتیبان یک‌بارمصرف تولید کنید.',
  backup_code_setup_hint:
    'وقتی کاربران نمی‌توانند عوامل MFA بالا را تأیید کنند، از گزینه پشتیبان استفاده کنید.',
  backup_code_error_hint:
    'برای استفاده از کد پشتیبان، حداقل یک روش MFA دیگر برای احراز هویت موفق کاربر لازم است.',
  email_verification_code: 'کد تأیید ایمیل',
  email_verification_code_description:
    'آدرس ایمیل را متصل کنید تا کدهای تأیید را دریافت و تأیید کنید.',
  phone_verification_code: 'کد تأیید پیامکی',
  phone_verification_code_description:
    'شماره تلفن را متصل کنید تا کدهای تأیید پیامکی را دریافت و تأیید کنید.',
  policy: 'سیاست',
  policy_description: 'سیاست MFA را برای جریان‌های ورود و ثبت‌نام تنظیم کنید.',
  two_step_sign_in_policy: 'سیاست تأیید دو مرحله‌ای هنگام ورود',
  user_controlled: 'کاربران می‌توانند MFA را خودشان فعال یا غیرفعال کنند',
  user_controlled_tip:
    'کاربران می‌توانند راه‌اندازی MFA را در اولین ورود یا ثبت‌نام رد کنند، یا آن را در تنظیمات حساب فعال/غیرفعال کنند.',
  mandatory: 'کاربران همیشه باید هنگام ورود از MFA استفاده کنند',
  mandatory_tip:
    'کاربران باید MFA را در اولین ورود یا ثبت‌نام راه‌اندازی کنند و برای تمام ورودهای بعدی از آن استفاده کنند.',
  require_mfa: 'الزام MFA',
  require_mfa_label:
    'این گزینه را فعال کنید تا تأیید دو مرحله‌ای برای دسترسی به برنامه‌های شما اجباری شود. اگر غیرفعال باشد، کاربران خودشان تصمیم می‌گیرند MFA را فعال کنند یا نه.',
  require_mfa_optional: 'MFA اختیاری: به کاربران اجازه دهید MFA را برای امنیت حساب خود فعال کنند',
  require_mfa_adaptive:
    'MFA تطبیقی: فقط وقتی ورود مشکوک به نظر می‌رسد (مثلاً کشور جدید / عدم فعالیت طولانی) MFA بخواهید',
  require_mfa_mandatory:
    'MFA اجباری: از همه کاربران می‌خواهد هر بار که وارد می‌شوند MFA را تکمیل کنند',
  set_up_prompt: 'اعلان راه‌اندازی MFA',
  no_prompt: 'از کاربران درخواست راه‌اندازی MFA نکنید',
  prompt_at_sign_in_and_sign_up:
    'از کاربران هنگام ثبت‌نام درخواست راه‌اندازی MFA کنید (قابل رد، یک‌بار)',
  prompt_only_at_sign_in:
    'از کاربران در تلاش ورود بعد از ثبت‌نام درخواست راه‌اندازی MFA کنید (قابل رد، یک‌بار)',
  prompt_at_sign_in_and_sign_up_mandatory:
    'از کاربران هنگام ثبت‌نام درخواست راه‌اندازی MFA کنید (غیرقابل رد)',
  prompt_only_at_sign_in_mandatory:
    'از کاربران در تلاش ورود بعد از ثبت‌نام درخواست راه‌اندازی MFA کنید (غیرقابل رد)',
  set_up_organization_required_mfa_prompt:
    'اعلان راه‌اندازی MFA برای کاربران پس از فعال‌سازی MFA توسط سازمان',
  prompt_at_sign_in_non_skippable:
    'از کاربران در ورود بعدی درخواست راه‌اندازی MFA کنید (غیرقابل رد)',
  email_primary_method_tip:
    'کد تأیید ایمیل از قبل روش اصلی ورود شماست. برای حفظ امنیت، نمی‌تواند برای MFA دوباره استفاده شود.',
  phone_primary_method_tip:
    'کد تأیید پیامکی از قبل روش اصلی ورود شماست. برای حفظ امنیت، نمی‌تواند برای MFA دوباره استفاده شود.',
  no_email_connector_warning:
    'هنوز اتصال‌دهنده ایمیل راه‌اندازی نشده است. قبل از تکمیل پیکربندی، کاربران نمی‌توانند از کدهای تأیید ایمیل برای MFA استفاده کنند. <a>{{link}}</a> در «اتصال‌دهنده‌ها».',
  no_sms_connector_warning:
    'هنوز اتصال‌دهنده پیامکی راه‌اندازی نشده است. قبل از تکمیل پیکربندی، کاربران نمی‌توانند از کدهای تأیید پیامکی برای MFA استفاده کنند. <a>{{link}}</a> در «اتصال‌دهنده‌ها».',
  no_email_connector_error:
    'بدون اتصال‌دهنده ایمیل نمی‌توان MFA کد تأیید ایمیل را فعال کرد. لطفاً ابتدا اتصال‌دهنده ایمیل را پیکربندی کنید.',
  no_sms_connector_error:
    'بدون اتصال‌دهنده پیامکی نمی‌توان MFA کد تأیید پیامکی را فعال کرد. لطفاً ابتدا اتصال‌دهنده پیامکی را پیکربندی کنید.',
  setup_link: 'راه‌اندازی',
};

export default Object.freeze(mfa);
