const add_on = {
  mfa_inline_notification:
    'MFA یک افزونه ${{price, number}} در ماه برای {{planName}} است. ماه اول بر اساس چرخه صورت‌حساب شما محاسبه می‌شود. <a>بیشتر بدانید</a>',
  security_features_inline_notification:
    'CAPTCHA، تجربه قفل سفارشی، و سایر ویژگی‌های امنیتی پیشرفته را فعال کنید—همه در یک بسته افزونه به قیمت ${{price, number}} در ماه.',
  custom_domain:
    'تا ۱۰ دامنه سفارشی را با قیمت ${{price, number}} اضافه کنید. ماه اول بر اساس چرخه صورت‌حساب شما محاسبه می‌شود. <a>بیشتر بدانید</a>',
  footer: {
    api_resource:
      'منابع اضافی <span>${{price, number}} در ماه / هر کدام</span> هزینه دارند. ماه اول بر اساس چرخه صورت‌حساب شما محاسبه می‌شود. <a>بیشتر بدانید</a>',
    machine_to_machine_app:
      'برنامه‌های ماشین به ماشین اضافی <span>${{price, number}} در ماه / هر کدام</span> هزینه دارند. ماه اول بر اساس چرخه صورت‌حساب شما محاسبه می‌شود. <a>بیشتر بدانید</a>',
    enterprise_sso:
      'Enterprise SSO به عنوان افزونه <span>${{price, number}} در ماه / هر کدام</span> برای {{planName}} هزینه دارد. ماه اول بر اساس چرخه صورت‌حساب شما محاسبه می‌شود. <a>بیشتر بدانید</a>',
    tenant_members:
      'اعضای اضافی <span>${{price, number}} در ماه / هر کدام</span> هزینه دارند. ماه اول بر اساس چرخه صورت‌حساب شما محاسبه می‌شود. <a>بیشتر بدانید</a>',
    organization:
      'سازمان یک افزونه <span>${{price, number}} در ماه</span> برای {{planName}} با سازمان‌های نامحدود است. ماه اول بر اساس چرخه صورت‌حساب شما محاسبه می‌شود. <a>بیشتر بدانید</a>',
    saml_apps:
      'برنامه‌های SAML اضافی <span>${{price, number}} در ماه / هر کدام</span> هزینه دارند. ماه اول بر اساس چرخه صورت‌حساب شما محاسبه می‌شود. <a>بیشتر بدانید</a>',
    third_party_apps:
      'برنامه‌های شخص ثالث اضافی <span>${{price, number}} در ماه / هر کدام</span> هزینه دارند. ماه اول بر اساس چرخه صورت‌حساب شما محاسبه می‌شود. <a>بیشتر بدانید</a>',
    roles:
      'کنترل دسترسی مبتنی بر نقش یک افزونه <span>${{price, number}} در ماه</span> برای پلن Pro با نقش‌های نامحدود است. ماه اول بر اساس چرخه صورت‌حساب شما محاسبه می‌شود. <a>بیشتر بدانید</a>',
  },
};

export default Object.freeze(add_on);
