const paywall = {
  applications:
    '{{count, number}} اپلیکیشن از محدودیت <planName/> به پایان رسیده است. برای رفع نیازهای تیم خود، پلن را ارتقا دهید. برای هرگونه کمک، با <a>تماس با ما</a> در ارتباط باشید.',
  applications_other:
    '{{count, number}} اپلیکیشن از محدودیت <planName/> به پایان رسیده است. برای رفع نیازهای تیم خود، پلن را ارتقا دهید. برای هرگونه کمک، با <a>تماس با ما</a> در ارتباط باشید.',
  machine_to_machine_feature:
    'برای دریافت اپلیکیشن‌های ماشین به ماشین اضافی و بهره‌مندی از تمام ویژگی‌های پریمیوم، به پلن <strong>Pro</strong> ارتقا دهید. اگر سوالی دارید <a>با ما تماس بگیرید</a>.',
  machine_to_machine:
    '{{count, number}} اپلیکیشن ماشین به ماشین از محدودیت <planName/> به پایان رسیده است. برای رفع نیازهای تیم خود، پلن را ارتقا دهید. برای هرگونه کمک، با <a>تماس با ما</a> در ارتباط باشید.',
  machine_to_machine_other:
    '{{count, number}} اپلیکیشن ماشین به ماشین از محدودیت <planName/> به پایان رسیده است. برای رفع نیازهای تیم خود، پلن را ارتقا دهید. برای هرگونه کمک، با <a>تماس با ما</a> در ارتباط باشید.',
  resources:
    '{{count, number}} منبع API از محدودیت <planName/> به پایان رسیده است. برای رفع نیازهای تیم خود، پلن را ارتقا دهید. برای هرگونه کمک <a>با ما تماس بگیرید</a>.',
  resources_other:
    '{{count, number}} منبع API از محدودیت <planName/> به پایان رسیده است. برای رفع نیازهای تیم خود، پلن را ارتقا دهید. برای هرگونه کمک <a>با ما تماس بگیرید</a>.',
  scopes_per_resource:
    '{{count, number}} مجوز به ازای هر منبع API از محدودیت <planName/> به پایان رسیده است. برای گسترش، همین حالا ارتقا دهید. برای هرگونه کمک <a>با ما تماس بگیرید</a>.',
  scopes_per_resource_other:
    '{{count, number}} مجوز به ازای هر منبع API از محدودیت <planName/> به پایان رسیده است. برای گسترش، همین حالا ارتقا دهید. برای هرگونه کمک <a>با ما تماس بگیرید</a>.',
  custom_domain:
    '{{count, number}} دامنه سفارشی از محدودیت <planName/> به پایان رسیده است. برای افزودن دامنه‌های سفارشی متعدد و مزایای پریمیوم، به یک پلن پولی ارتقا دهید. اگر سوالی دارید، <a>با ما تماس بگیرید</a>.',
  custom_domain_others:
    '{{count, number}} دامنه سفارشی از محدودیت <planName/> به پایان رسیده است. برای افزودن دامنه‌های سفارشی متعدد و مزایای پریمیوم، به یک پلن پولی ارتقا دهید. اگر سوالی دارید، <a>با ما تماس بگیرید</a>.',
  social_connectors:
    '{{count, number}} کانکتور اجتماعی از محدودیت <planName/> به پایان رسیده است. برای رفع نیازهای تیم خود، پلن را برای کانکتورهای اجتماعی اضافی و قابلیت ایجاد کانکتورهای خود با پروتکل‌های OIDC، OAuth 2.0 و SAML ارتقا دهید. اگر به کمک نیاز دارید، <a>با ما تماس بگیرید</a>.',
  social_connectors_other:
    '{{count, number}} کانکتور اجتماعی از محدودیت <planName/> به پایان رسیده است. برای رفع نیازهای تیم خود، پلن را برای کانکتورهای اجتماعی اضافی و قابلیت ایجاد کانکتورهای خود با پروتکل‌های OIDC، OAuth 2.0 و SAML ارتقا دهید. اگر به کمک نیاز دارید، <a>با ما تماس بگیرید</a>.',
  standard_connectors_feature:
    'برای ایجاد کانکتورهای خود با پروتکل‌های OIDC، OAuth 2.0 و SAML، به علاوه کانکتورهای اجتماعی نامحدود و تمام ویژگی‌های پریمیوم، به پلن <strong>Hobby</strong> یا <strong>Pro</strong> ارتقا دهید. اگر به کمک نیاز دارید، <a>با ما تماس بگیرید</a>.',
  standard_connectors:
    '{{count, number}} کانکتور اجتماعی از محدودیت <planName/> به پایان رسیده است. برای رفع نیازهای تیم خود، پلن را برای کانکتورهای اجتماعی اضافی و قابلیت ایجاد کانکتورهای خود با پروتکل‌های OIDC، OAuth 2.0 و SAML ارتقا دهید. اگر به کمک نیاز دارید، <a>با ما تماس بگیرید</a>.',
  standard_connectors_other:
    '{{count, number}} کانکتور اجتماعی از محدودیت <planName/> به پایان رسیده است. برای رفع نیازهای تیم خود، پلن را برای کانکتورهای اجتماعی اضافی و قابلیت ایجاد کانکتورهای خود با پروتکل‌های OIDC، OAuth 2.0 و SAML ارتقا دهید. اگر به کمک نیاز دارید، <a>با ما تماس بگیرید</a>.',
  standard_connectors_pro:
    '{{count, number}} کانکتور استاندارد از محدودیت <planName/> به پایان رسیده است. برای رفع نیازهای تیم خود، برای کانکتورهای اجتماعی اضافی و قابلیت ایجاد کانکتورهای خود با پروتکل‌های OIDC، OAuth 2.0 و SAML به پلن Enterprise ارتقا دهید. اگر به کمک نیاز دارید، <a>با ما تماس بگیرید</a>.',
  standard_connectors_pro_other:
    '{{count, number}} کانکتور استاندارد از محدودیت <planName/> به پایان رسیده است. برای رفع نیازهای تیم خود، برای کانکتورهای اجتماعی اضافی و قابلیت ایجاد کانکتورهای خود با پروتکل‌های OIDC، OAuth 2.0 و SAML به پلن Enterprise ارتقا دهید. اگر به کمک نیاز دارید، <a>با ما تماس بگیرید</a>.',
  roles:
    'برای افزودن نقش‌ها و مجوزهای اضافی، پلن را ارتقا دهید. اگر به کمک نیاز دارید، <a>با ما تماس بگیرید</a>.',
  scopes_per_role:
    '{{count, number}} مجوز به ازای هر نقش از محدودیت <planName/> به پایان رسیده است. برای افزودن نقش‌ها و مجوزهای اضافی، پلن را ارتقا دهید. برای هرگونه کمک، <a>با ما تماس بگیرید</a>.',
  scopes_per_role_other:
    '{{count, number}} مجوز به ازای هر نقش از محدودیت <planName/> به پایان رسیده است. برای افزودن نقش‌ها و مجوزهای اضافی، پلن را ارتقا دهید. برای هرگونه کمک، <a>با ما تماس بگیرید</a>.',
  saml_applications_oss:
    'اپلیکیشن SAML اضافی با پلن Enterprise لاگتو در دسترس است. اگر به کمک نیاز دارید با ما تماس بگیرید.',
  saml_applications_oss_limit_notice:
    'نمونه متن‌باز شما تا {{limit}} اپلیکیشن SAML را پشتیبانی می‌کند. می‌توانید از Logto Cloud استفاده کنید یا برای گزینه‌های بیشتر با ما تماس بگیرید.',
  logto_pricing_button_text: 'قیمت‌گذاری Logto Cloud',
  saml_applications:
    'اپلیکیشن SAML اضافی با پلن Enterprise لاگتو در دسترس است. اگر به کمک نیاز دارید با ما تماس بگیرید.',
  saml_applications_add_on:
    'با ارتقا به یک پلن پولی، ویژگی اپلیکیشن SAML را فعال کنید. برای هرگونه کمک، <a>با ما تماس بگیرید</a>.',
  hooks:
    '{{count, number}} وب‌هوک از محدودیت <planName/> به پایان رسیده است. برای ایجاد وب‌هوک‌های بیشتر، پلن را ارتقا دهید. اگر به کمک نیاز دارید، <a>با ما تماس بگیرید</a>.',
  hooks_other:
    '{{count, number}} وب‌هوک از محدودیت <planName/> به پایان رسیده است. برای ایجاد وب‌هوک‌های بیشتر، پلن را ارتقا دهید. اگر به کمک نیاز دارید، <a>با ما تماس بگیرید</a>.',
  mfa: 'با ارتقا به یک پلن پولی، MFA را برای امنیت تأیید هویت فعال کنید. اگر به کمک نیاز دارید، <a>با ما تماس بگیرید</a>.',
  organizations:
    'با ارتقا به یک پلن پولی، سازمان‌ها را فعال کنید. اگر به کمک نیاز دارید، <a>با ما تماس بگیرید</a>.',
  third_party_apps:
    'با ارتقا به یک پلن پولی، لاگتو را به عنوان IdP برای اپلیکیشن‌های شخص ثالث فعال کنید. برای هرگونه کمک، <a>با ما تماس بگیرید</a>.',
  sso_connectors:
    'با ارتقا به یک پلن پولی، SSO سازمانی را فعال کنید. برای هرگونه کمک، <a>با ما تماس بگیرید</a>.',
  tenant_members:
    'با ارتقا به یک پلن پولی، ویژگی همکاری را فعال کنید. برای هرگونه کمک، <a>با ما تماس بگیرید</a>.',
  tenant_members_dev_plan:
    'به محدودیت {{limit}} عضو رسیده‌اید. برای افزودن عضو جدید، یک عضو را حذف کنید یا یک دعوت‌نامه در انتظار را لغو کنید. برای جایگاه‌های بیشتر، با ما تماس بگیرید.',
  custom_jwt: {
    title: 'افزودن ادعاهای سفارشی',
    description:
      'برای قابلیت JWT سفارشی و مزایای پریمیوم، به یک پلن پولی ارتقا دهید. اگر سوالی دارید، <a>با ما تماس بگیرید</a>.',
  },
  branding_customization:
    'با ارتقا پلن خود، کنترل کامل برندینگ را با ویژگی‌های "مخفی کردن برندینگ لاگتو" و "رابط کاربری خود را بیاورید" فعال کنید.',
  bring_your_ui: 'برای قابلیت رابط کاربری سفارشی و مزایای پریمیوم، به یک پلن پولی ارتقا دهید.',
  security_features:
    'با ارتقا به پلن Pro، ویژگی‌های امنیتی پیشرفته را فعال کنید. اگر سوالی دارید، <a>با ما تماس بگیرید</a>.',
  collect_user_profile:
    'برای جمع‌آوری اطلاعات پروفایل کاربری اضافی در هنگام ثبت‌نام، به یک پلن پولی ارتقا دهید. اگر سوالی دارید، <a>با ما تماس بگیرید</a>.',
  passkey_sign_in:
    'برای قابلیت ورود با پَس‌کی و مزایای پریمیوم، به یک پلن پولی ارتقا دهید. اگر سوالی دارید، <a>با ما تماس بگیرید</a>.',
};

export default Object.freeze(paywall);
