const organization = {
  require_membership: 'Пользователь должен быть участником организации, чтобы продолжить.',
  default_organization_missing:
    'Некоторые из стандартных организаций не существуют в базе данных, пожалуйста, убедитесь, что вы создали организации сначала',
  default_organization_role_missing:
    'Некоторые из ролей организации по умолчанию не существуют в базе данных. Пожалуйста, убедитесь, что сначала созданы роли организации',
};

export default Object.freeze(organization);
