const quota_item_unlimited = {
  tenant: 'Неограниченное количество арендаторов',
  mau: 'Неограниченное количество MAU',
  application: 'Неограниченное количество приложений',
  m2m: 'Неограниченное количество приложений между машинами',
  resource: 'Неограниченное количество API ресурсов',
  scopes_per_resource: 'Неограниченное количество разрешений на ресурс',
  social_connector: 'Неограниченное количество социальных коннекторов',
  standard_connector_unlimited: 'Неограниченное количество стандартных коннекторов',
  roles: 'Неограниченное количество ролей',
  scopes_per_role: 'Неограниченное количество разрешений на роль',
  audit_logs_retention: 'Неограниченное количество дней',
  hooks: 'Неограниченное количество хуков',
};

export default quota_item_unlimited;
